# ①Node.jsの公式イメージをベースにする
#「このコンテナは Node.js 18 を元に作ります」という意味。

FROM node:18

# ②コンテナ内の作業ディレクトリ
# 作業ディレクトリを指定
# コンテナの中で「どのフォルダを基準にするか」を決める。
# この後の COPY や RUN は、このディレクトリの中で実行される。

WORKDIR /usr/src/app

# ③package.json と package-lock.json をコピー

COPY package*.json ./

# ④依存関係をインストール
# コンテナ内でコマンド実行
# 依存パッケージをインストールする。
# こうすることで「依存関係がインストールされた状態」がイメージに保存される。

RUN npm install

# ⑤アプリのソースコードをコピー
# 自分のPC上のプロジェクトを、コンテナの作業フォルダに持ってくる。

COPY . .

# ⑦コンテナで使うポートを指定
# 「このコンテナは 3000 番ポートを使います」と宣言

EXPOSE 3000

# ⑧コンテナが起動した時に実行するコマンド
# docker run するときにデフォルトで実行されるもの。
# * ここでは Node.js で server.js を起動している

CMD ["node", "server.js"]

